wmsmobile/src/Enums/итWMSТипыЗадачТСД/итWMSТипыЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSТипыЗадачТСД</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
  </enumValues>
  <enumValues>
    <name>Наборка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКакЕсть</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>КонтрольнаяАгрегация</name>
  </enumValues>
  <enumValues>
    <name>Проверка</name>
  </enumValues>
  <enumValues>
    <name>Переупаковка</name>
  </enumValues>
</mdclass:Enum>

wmsmobile/src/Documents/итРазмещение/итРазмещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итРазмещение</name>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихКодыЯчеекДокумента</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

wmsmobile/src/CommonModules/ОбработчикДанныхРазмещения/Module.bsl
// Процедура - О бработать документ размещение
//
// Параметры:
//  Документ			 - Структура - структура содержащая в себе данные документа на сервере 
//  АдресХраненияДанных	 - Строка - адрес временного хранилища или адрес Временного хранилища формы, получаемого методом СлужебныеФункцииИПроцедурыКлиентСервер.ПоместитьВоВременноеХранилищеФормы
//
Процедура ОБработатьДокументРазмещение(Документ,АдресХраненияДанных="")Экспорт 
ТипОбрабатываемойЗадачи=Перечисления.итWMSТипыЗадачТСД.Размещение;
ДокументТСД=НайтиСоздатьДокументРазмещения(Документ,ТипОбрабатываемойЗадачи,АдресХраненияДанных);
Если не Документ.Свойство("МассивЗадач") тогда
	ВызватьИсключение "Ошибка типа данных";
КонецЕсли;

Если ТипЗнч(Документ.ДополнительныеДанные)=тип("Структура") тогда
	Если  Документ.ДополнительныеДанные.Свойство("ДанныеШтрихКодовЯчеекДокумента") тогда
		ДанныеШтрихКодовЯчеекДокумента= Документ.ДополнительныеДанные.ДанныеШтрихКодовЯчеекДокумента;
		ОбъектДокументаТСД=ДокументТСД.ПолучитьОбъект();
		ОбъектДокументаТСД.ШтрихКодыЯчеекДокумента.Очистить();
		для Каждого стр из  ДанныеШтрихКодовЯчеекДокумента цикл
			НоваяСтрокаДополнительныхДанных=ОбъектДокументаТСД.ШтрихКодыЯчеекДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДополнительныхДанных,стр);
		КонецЦикла;
		ОбъектДокументаТСД.Записать();
	КонецЕсли;
КонецЕсли;
СтруктураТиповыхПараметровЗадач=ОбработчикДанныхОбщиеФункцииИПроцедуры.СформироватьТиповуюСтруктуруПараметровДанныхЗадач(,ДокументТСД,ТипОбрабатываемойЗадачи,АдресХраненияДанных);

для Каждого Задача из Документ.МассивЗадач цикл
	СтруктураТиповыхПараметровЗадач.Задача=Задача;
	ОбработчикДанныхОбщиеФункцииИПроцедуры.ОбработчикСозданиеИзменениеУдалениеЗадач(СтруктураТиповыхПараметровЗадач);
КонецЦикла;
ОбработчикДанныхОбщиеФункцииИПроцедуры.ПроверитьУдалитьДокумент(ДокументТСД,АдресХраненияДанных);

КонецПроцедуры


#Область СлужебныеФункцииИпроцедурыПриемки
// Функция - Найти создать документ размещения
//
// Параметры:
//  Документ			 - Структура - структура содержащая в себе данные документа на сервере
//  ТипЗадачи			 - Перечисления.итWMSТипыЗадачТСД - тип задачи документа (в данном модуле Размещение) 
//  АдресХраненияДанных	 - Строка - адрес временного хранилища или адрес Временного хранилища формы, получаемого методом СлужебныеФункцииИПроцедурыКлиентСервер.ПоместитьВоВременноеХранилищеФормы
// 
// Возвращаемое значение:
// ДокументСсылка.итРазмещение  - ссылка на документ Размещения
//

Функция НайтиСоздатьДокументРазмещения(Документ,ТипЗадачи,АдресХраненияДанных="")
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итРазмещение.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.итРазмещение КАК итРазмещение
		|ГДЕ
		|	итРазмещение.ГУИД = &ГУИД";
	
	Запрос.УстановитьПараметр("ГУИД", Документ.ГУИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	иначе
		НовыйДокументРазмещения = Документы.итРазмещение.СоздатьДокумент();
		НовыйДокументРазмещения.ГУИД=Документ.ГУИД;
		НовыйДокументРазмещения.Номер=Документ.Номер;
		НовыйДокументРазмещения.Дата=Документ.Дата;
		НовыйДокументРазмещения.ТипЗадачи=ТипЗадачи;
		//Если ТипЗнч(Документ.ДополнительныеДанные)=Тип("Массив") тогда
		//	для Каждого стр из Документ.ДополнительныеДанные цикл
		//		НоваяСтрокаФизическихДанных=НовыйДокументПриемки.ДанныеФизическогоНосителя.Добавить();
		//		ЗаполнитьЗначенияСвойств(НоваяСтрокаФизическихДанных,стр);
		//		
		//	КонецЦикла;
		//КонецЕсли;
		НовыйДокументРазмещения.Записать();
		Если ЗначениеЗаполнено(АдресХраненияДанных) тогда
		ОбработчикДанныхОбщиеФункцииИПроцедуры.РаботаСВременнымХранилищемМассивИзменений(АдресХраненияДанных,"Создан",НовыйДокументРазмещения.Ссылка);
		КонецЕсли;
		Возврат НовыйДокументРазмещения.Ссылка;
	КонецЕсли;	
			
		//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	КонецФункции
#КонецОбласти
